{"title":{"0":"Human Resources Specialist (P-3), #90700, LAC Regional Office – Panama City","1":"Human Resources Officer, NOB, FT, Bamako Mali (Malian Nationals Only)"},"text": {"0": "<p></p>  <p>UNICEF works in some of the world’s toughest places, to reach the world’s most disadvantaged children. To save their lives. To defend their rights. To help them fulfill their potential.</p>  <p>Across 190 countries and territories, we work for every child, everywhere, every day, to build a better world for everyone.</p>  <p>And we never give up.</p>  <p><strong>For every child, a better future...</strong></p>  <p>Under the supervision of the HR Manager, you will be accountable for implementing HR services that enhance the capacity of your clients to deliver on their business goals and objectives in the Latin America and Caribbean Region (LACR).<strong>How can you make a difference?</strong></p>  <p>In doing so, you will demonstrate the ability to anticipate HR-related needs and develop subsequent plans and solutions that align HR management with business objectives. This will include:<strong>Strategic Business Partnering</strong></p>  <p><li>Serve as the single point of contact for your Regional Office (RO) and/or Country Office (CO) client portfolio on advice pertaining to all aspects of the employment life cycle.</li> <li>Proactively collaborate with clients to help fulfill their business goals through anticipating HR-related needs and presenting subsequent plans of action.</li> <li>Advice clients on the resolution of human resources issues ensuring equitable and transparent solutions that protects both the staff and organization’s interests.</li> <li>Collaborate effectively with other sections as well as Headquarters and centers of expertise to provide coherent solutions for clients.</li> <li>Actively participate in establishing and implementing the annual work plan, setting priorities/targets and performance measures.</li> <li>Monitor work progress and ensure results are achieved according to schedule and performance standards.</li></p>  <p><strong>Acting as a Change Agent</strong></p>  <p><li>Liaise with the Regional and Country Offices to support and contribute to corporate HR strategy formulation and global implementation.</li> <li>Interpret and analyze HR data to help inform strategic decision making on HR processes and strategies.</li> <li>Promote HR initiatives that support organizational culture change, improved results and staff development and explain the scope and ramifications of proposed HR initiatives, promoting understanding of their purpose and functional advantages. Promote the organizational goals and targets for gender equity and cultural diversity.</li></p>  <p><strong>Employee Championing</strong></p>  <p><li>Contribute to the development of competencies for all staff in assigned client portfolio, assisting in the development of a comprehensive framework in support of the development of the talent pipeline.</li> <li>Recommend efficient and cost-effective learning products which strengthen staff capacity to contribute effectively to business goals.</li> <li>Provide day-to-day performance and talent management guidance to line management (e.g., coaching, counseling, career development, and disciplinary actions).</li> <li>Work closely with management and employees to improve work relationships, build morale, and increase productivity and retention.</li></p>  <p><strong>Relationship Management</strong></p>  <p><li>Maintain and enhance relationships with centers of expertise, the global shared services center and global staff association.</li> <li>Collaborate with sister-agencies on best HR practices within the UN or other affiliated organizations.</li></p>  <p><strong>To qualify as an advocate for every child you will have…</strong></p>  <p><li>An Advanced University Degree in human resource management, business management, international relations, psychology or another related field.</li> <li>A minimum of Five (5) years of increasingly responsible professional experience in human resource management in an international organization and/or large corporation is required.</li> <li>Direct hands-on experience in the implementation of HR solutions in a development context is an asset.</li> <li>Developing country work experience and/or familiarity with emergency is considered an asset.</li> <li>Fluency in English and working knowledge of Spanish is required. Knowledge of French and/or Portuguese is considered an asset.</li></p>  <p><strong>Skills Required:</strong></p>  <p><li>In-depth technical knowledge of the principles and concepts of HR management.</li> <li>Ability to identify and analyze systemic issues, formulate opinions and make conclusions and recommendations to resolve same.</li> <li>Excellent knowledge of organizational and HR information technology systems and tools.</li> <li>Ability to empathize with client managers, supervisors and staff while advocating for consistent and equitable applications of promulgated HR regulations and rules.</li></p>  <p><strong>For every Child, you demonstrate…</strong>UNICEF’s core values of Commitment, Diversity and Integrity and core competencies in Communication, Working with People and Drive for Results. View our competency framework at:<a href='http://www.unicef.org/about/employ/files/UNICEF_Competencies.pdfUNICEF'>http://www.unicef.org/about/employ/files/UNICEF_Competencies.pdfUNICEF</a> is committed to diversity and inclusion within its workforce, and encourages all candidates, irrespective of gender, nationality, religious and ethnic backgrounds, including persons living with disabilities, to apply to become a part of the organization.<strong>Remarks:</strong>Only shortlisted candidates will be contacted and advance to the next stage of the selection process.Mobility is a condition of international professional employment with UNICEF and an underlying premise of the international civil service and this position is classified as “rotational” which means the incumbent is expected to rotate to another duty station upon completion of their tour of duty.UNICEF is committed to diversity and inclusion within its workforce, and encourages qualified candidates from all backgrounds to apply.</p>  <p></p>","1": "<p></p>  <p><strong>Purpose of the Position</strong></p>  <p>Under the direct supervision of the HR Manager, assists in the human resources management of all categories of staff in the country office.</p>  <p><strong>Major duties and responsibilities</strong></p>  <p><li>Responsible for determining and implementing entitlement for international and local staff in accordance with UNICEF rules, regulations, instructions and directives, (e.g., home leave, education grant, dependency allowance, language allowance).</li></p>  <p><li>Responsible for the recruitment process of national professional officers, general service, and temporary staff, according to UNICEF rules, regulations, procedures and policies. Reviews appropriateness of job descriptions arranges internal and/or external advertisement(s) and, in consultation with supervisors, undertakes the short-listing of candidates and conducts preliminary interviews. Assist in carrying out the recruitment process of international professionals.</li> <li>Provides briefing and orientation to newly arrived staff on entitlements and administrative procedures/requirements (ID, security, opening of bank account, etc).</li> <li>Assist in the identification of training needs, preparation of training proposals, arrangements for implementation and evaluation of impact on staff/office performance.</li> <li>Ensure the preparation, implementation and monitoring of the Office annual Learning and Development Plan.</li> <li>Assist in advising and informing all staff on the correct application and interpretation of UN/UNICEF personnel rules, regulations, procedures and policies. Provides on-going counselling to all categories of staff in the office with regard to their entitlement.</li> <li>Monitors potential staff relations or personnel problem areas and keeps HR Chief informed of situations and recommends courses of action.</li> <li>Follows up on all staff contractual status and ensures in liaison with GSSC that appropriate and timely actions for renewals of contracts, promotions, within-grade increments, &amp; performance evaluations are taken.</li> <li>Assist the HR Manager as resource to staff/management bodies such CMT, JCC and other meetings providing administrative support and guidance on systems and procedures. Responsible for the agenda and preparation of minutes.</li> <li>Ensures job descriptions for all posts are up-to-date, properly recorded and duly classified. Provides guidance and support in the preparation of job descriptions for all categories of staff (professional and general service).</li> <li>Assist the HR Manager in the budget preparation and reviews process through an analysis of staffing pattern and needs of the office, makes recommendations regarding the organizational structure of the office, and the effective planning of human resources. Participates in management meetings affecting human resource management and planning.</li> <li>Undertakes visits to zonal-offices to provide briefing and orientation to staff on entitlement-related issues.</li> <li>Makes decisions on the appropriate application and interpretation of personnel-related rules, regulations, policies and procedures, as well as on work priorities, which affect the efficient delivery of personnel services in the office and the well-being of staff members.</li> <li>Assist in making recommendations regularly on appointment and placement of staff, staff development and training, job descriptions and local job classification results, as well as interpretation and application of personnel rules, regulations, policies and procedures involving complex personnel matters.</li> <li>Such recommendations affect the overall management of the office, as well as the well-being and morale of the staff.</li> <li>Errors in interpretation and application of personnel rules or inappropriate advice to staff members would result in delays in the recruitment of staff, cause unnecessary corrections in the processing of matters, and may result in damaging the image and credibility of the office management, staff morale and misuse of organizational resources.</li> <li>General supervision is provided by the HR Manager. Incumbent is expected to be fully knowledgeable in the field of work and therefore is expected to exercise judgement and initiative, establish work priorities, follow up actions and ensure accuracy of work. Also advise HR Manager on application of HR rules and regulations.</li></p>  <p><strong>Qualifications and skills of Successful Candidate</strong></p>  <p><li>Bachelor Degree in Business Administration, with specialization in HR or Personnel Management.</li> <li>Two years of professional work experience in the field of HR or personnel administration. Work experience in an international organization is desirable.</li> <li>Good judgement, initiative, high sense of responsibility, tact and discretion, with sensitivity to different cultures.</li> <li>Good analytical, negotiating, writing and communication skills.</li> <li>Skills in interviewing techniques.</li> <li>Computer skills, including internet navigation, and various office applications.</li> <li>Fluency in French and English languages is required. Knowledge of another UN language is an asset.</li></p>  <p><strong>Core Values</strong></p>  <p><li>Commitment</li> <li>Diversity and Inclusion</li> <li>Integrity</li></p>  <p><strong>Core competencies</strong></p>  <p><li>Communication</li> <li>Drive for Result</li> <li>Working with People</li></p>  <p><strong>Functional Competencies</strong></p>  <p><li>Analyzing</li> <li>Applying Technical Expertise</li> <li>Following Instructions and Procedures</li> <li>Planning and Organizing</li> <li>Relating and Networking</li></p>  <p>UNICEF is committed to diversity and inclusion within its workforce and encourages qualified female and male candidates from all national, religious and ethnic backgrounds, including persons living with disabilities, to apply to become a part of our organization.</p>  <p />  <p></p>"}}